a, op, b = map(str.strip, input('Введите числа >>> ').split(' '))
a, b = map(int, (a, b))

if op == '+':
    print(a + b)
if op == '-':
    print(a - b)
if op == '*':
    print(a * b)
    
# git log - показывает список (ленту) коммитов, их авторов, даты, хеши и сообщения.

# git show - показывает подробную информацию и изменения конкретного одного объекта (обычно последнего или указанного коммита).

# git diff показывает разницу (построчный патч) между двумя состояниями кода (например, между рабочим каталогом и индексом, или между двумя разными коммитами).

# git log -S - "строка"	Коммиты, в которых количество упоминаний заданной строки изменилось (строка была добавлена или полностью удалена).

# git blame	Хэш коммита, автора и дату последнего изменения для каждой конкретной строки в файле.

# git restore file.txt Файл откатывается к состоянию последнего git add или коммита.

#git restore --source=HEAD~2 file.txt Файл полностью заменяется версией из старого коммита.

# git reset --hard - Эта команда перемещает указатель текущей ветки назад на выбранный коммит и жестко перезаписывает вашу рабочую директорию и индекс.

# git revert - Эта команда вычисляет изменения, которые были сделаны в указанном коммите, и совершает противоположные действия (если в коммите была добавлена строка — revert её удалит, и наоборот).

#Безопасность revert: Так как revert просто создает новый коммит, для Git это выглядит как обычное рядовое обновление ветки. Вы сможете отправить его на сервер обычной командой git push. Ваши коллеги просто сделают git pull, получат новый коммит отмены, и никто не столкнется с поломкой истории.